// Task 04

// Створіть іменований модуль prepareString, який отримує рядок, видаляє пробіли на початку та в кінці, переводить текст у нижній регістр і робить першу літеру великою.
// Модуль повинен повертати опрацьований рядок. Використовуйте синтаксис CommonJS.

// Ці дії дуже корисні під час обробки інформації перед збереженням у базу даних,
// наприклад, під час збереження імен. Подумайте, які додаткові вимоги ви б додали до цього завдання в реальному проєкті.


const prepareString = (str) => {
    if(!str?.trim()) {
        return '';
    }

    const formatStr = str.trim().toLowerCase();

    return formatStr.split(' ').map(item => item[0].toUpperCase() + item.slice(1)).join(' ');
}

module.exports = prepareString;